{
  "items": [
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Kotlin",
      "info": "",
      "release": "2017-03-01",
      "name": "Kotlin",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p>Widely adopted after Google adoption as a standard language for Android apps.Wheel on the JVM, which makes life easier for the java developers and with many facilities of modern languages</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "C#",
      "info": "",
      "release": "2017-03-01",
      "name": "csharp",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p>With the broad adoption and beautiful work of Microsoft in .NET Core, it is a language that will still last many years on the rise.The possibility of development in Linux OS, running on servers outside the IIS is something of much value as well.</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "NodeJS",
      "info": "",
      "release": "2017-03-01",
      "name": "NodeJS",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p>For his range of almost infinite libraries, for his ease in working with asynchronous and Io Non-Blocking made the node gain the hearts of Devs.The possibility of working with JS/TS in Backend is something that enables many horizons</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "PHP",
      "info": "",
      "release": "2017-03-01",
      "name": "PHP",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p> The controversial language has been receiving several updates that left them with a new language face.With market players like Facebook, Wikipedia, Slack, Ebanx, WordPress, PHP still has a lot of space in web development.However what most catches the attention of PHP in recent times was Swoole.Which is an internal PHP framework that its performance is as good as of Golang and even better in some benchmarks.</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Python",
      "info": "",
      "release": "2017-03-01",
      "name": "Python",
      "ring": "trial",
      "quadrant": "languages-and-frameworks",
      "body": "The most popular language among AI developers is a great language to implement web systems.Simple and with a low learning curve has been raising many new developers"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Golang",
      "info": "",
      "release": "2017-03-01",
      "name": "Golang",
      "ring": "trial",
      "quadrant": "languages-and-frameworks",
      "body": "<p>It has been widely adopted in systems that need your business rule, high performance at low cost.GO is an extremely simple and direct language, which brings positive and negative points in the dev. However, your performance is extremely relevant.</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Dart",
      "info": "",
      "release": "2017-03-01",
      "name": "Dart",
      "ring": "assess",
      "quadrant": "languages-and-frameworks",
      "body": "<p>With the popularity of the Flutter in all frontands; Web/Mobile Dart has gained a space to shine. A very simple language but with a performance ok. Attention points is the low amount of external resources, such as LIBS and extensions</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Rust",
      "info": "",
      "release": "2017-03-01",
      "name": "Rust",
      "ring": "assess",
      "quadrant": "languages-and-frameworks",
      "body": "<p>It has been the most popular language of market research, with incredible performance and the possibility of developers leave behind C ++, Rust has been gaining more and more market. Android has been rewritten in Rust and featuring several Memory Safe indicators that leave anyone's eyes shining.</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Deno",
      "info": "",
      "release": "2017-03-01",
      "name": "Deno",
      "ring": "assess",
      "quadrant": "languages-and-frameworks",
      "body": "<p>Created to be a successor to the Node, I can be an output for those who like TypeScript but prefer something more Safe than Node.Deno comes to solve some issues that the node sinned, such as security for example.With the same creator of the node, Ryan Dahl has been the main name in the development of the node.</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Typescript",
      "info": "",
      "release": "2017-03-01",
      "name": "Typescript",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p>TypeScript is a programming language which was developed by Microsoft. It is free, open source and superset of the JavaScript. <br><br> Maintained by Microsoft, the language comes with an addition of class-based object oriented programming, as well as optional static typing to the JavaScript. <br><br> It is possible to create JavaScript applications for client or server side using the TypeScript. TypeScript has been created to tackle the development of large programs. Being a superset of the JavaScript, it can be transcompiled to the latter and all JavaScript programs can be considered as TypeScript programs. </p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Angular",
      "info": "",
      "release": "2017-03-01",
      "name": "Angular",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p>Angular is an open-source, JavaScript framework written in TypeScript. Google maintains it, and its primary purpose is to develop single-page applications. As a framework, Angular has clear advantages while also providing a standard structure for developers to work with. It enables users to create large applications in a maintainable manner. </p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "React.js",
      "info": "",
      "release": "2017-03-01",
      "name": "React.js",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p>React is a JavaScript-based UI development library. Facebook and an open-source developer community run it. Although React is a library rather than a language, it is widely used in web development. The library first appeared in May 2013 and is now one of the most commonly used frontend libraries for web development. React offers various extensions for entire application architectural support, such as Flux and React Native, beyond mere UI. </p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Keycloak",
      "info": "",
      "release": "2023-04-18",
      "name": "Keycloak",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Keycloak is an open-source identity and access management platform that can be used to add authentication and authorization features to web and mobile applications. It allows user authentication through a variety of identity providers, including social networks like Google and Facebook, as well as corporate identity providers such as Active Directory and LDAP.</p><p>Keycloak offers a centralized management interface for administering users, groups, and security policies. It also supports multi-factor authentication and integration with other security services such as digital certificates.</p><p>Keycloak can be used in a variety of use cases, including:</p><ul><li>User authentication: Keycloak can be used to authenticate users in web and mobile applications, supporting a wide range of identity providers.</li><li>User management: Keycloak offers features for managing users, groups, and security roles in a centralized interface.</li><li>Access authorization: Keycloak allows developers to control access to application resources based on defined security policies.</li><li>Integration with other security services: Keycloak can be integrated with other security services such as digital certificates and multi-factor authentication solutions.</li></ul>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Open API",
      "info": "",
      "release": "2017-03-01",
      "name": "Open API",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>he OpenAPI Specification (OAS) defines a standard, programming language-agnostic interface description for HTTP APIs, which allows both humans and computers to discover and understand the capabilities of a service without requiring access to source code, additional documentation, or inspection of network traffic. When properly defined via OpenAPI, a consumer can understand and interact with the remote service with a minimal amount of implementation logic. Similar to what interface descriptions have done for lower-level programming, the OpenAPI Specification removes guesswork in calling a service. </p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "title": "Sonarqube",
      "info": "",
      "release": "2023-04-18",
      "name": "Sonarqube",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>SonarQube is an open-source code analysis platform that helps manage code quality and application security. It allows development teams to perform code reviews and static code analysis to detect security issues, vulnerabilities, and other code quality issues.</p><p>SonarQube can be used in a wide variety of use cases, including:</p><ul><li>Code quality assessment: SonarQube provides an overview of a project's code quality, including identifying security issues, vulnerabilities, and other code quality issues.</li><li>Vulnerability detection: SonarQube can detect security vulnerabilities such as SQL injection, cross-site scripting (XSS), code injection attacks, and other common types of vulnerabilities.</li><li>Duplicate code identification: SonarQube can identify and track duplicated code snippets, reducing code complexity and improving maintainability.</li><li>Code coverage analysis: SonarQube can analyze code coverage and provide detailed information on how code is tested and how tests can be improved.</li><li>Code analysis for regulatory compliance: SonarQube can be used to analyze code for regulatory compliance such as PCI-DSS, HIPAA, GDPR, and others.</li><li>Continuous integration: SonarQube can be integrated with continuous integration tools such as Jenkins to ensure that code quality is verified at every stage of the development process.</li><li>Code analysis in multiple languages: SonarQube is compatible with several programming languages including Java, C#, JavaScript, TypeScript, Python, and others.</li></ul><p>In summary, SonarQube is an essential platform to ensure code quality and security. It provides detailed analysis and metrics to help development teams improve code quality and reduce the risk of vulnerabilities and other security issues.</p>"
    },
    {
      "flag": "default",
      "featured": true,
      "revisions": [],
      "name": "VueJS",
      "title": "Vue JS",
      "ring": "adopt",
      "quadrant": "languages-and-frameworks",
      "body": "<p><div><p>Vue.js is a popular JavaScript framework for building user interfaces and single-page applications. It was created by Evan You in 2014 and has since grown in popularity due to its simplicity and flexibility.</p><p>One of the key features of Vue.js is its reactivity system, which allows developers to easily track and update the state of a component. This makes it particularly well-suited for building complex and interactive user interfaces.</p><p>Vue.js also includes a powerful set of official and community-developed tools and libraries, such as Vue CLI, Vuex, and Vue Router. These tools and libraries make it easy to set up, develop, and maintain Vue.js projects, even for large and complex applications.</p><p>In addition to its technical benefits, Vue.js also has a large and active community of developers, which results in a wealth of resources, tutorials, and support. This makes it a great choice for organizations that want to adopt a modern, well-supported framework for their frontend projects.</p><p>Adoption of Vue.js provides the following benefits:</p><ul><li>Easy to learn and understand, even for developers with limited experience with JavaScript frameworks</li><li>Performance and flexibility</li><li>Good developer experience</li><li>Large and active community</li><li>A wide range of available tools and libraries</li></ul><p>This make it a suitable choice for a wide range of projects, from small and simple websites to large and complex web applications.</p></div></p>\n",
      "info": "",
      "release": "2017-03-01"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Cognito",
      "info": "",
      "release": "2023-04-18",
      "name": "Cognito",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Amazon Cognito is a service managed by Amazon Web Services (AWS) that enables easy and scalable addition of authentication, authorization, and user management to web and mobile applications.</p><p>With Amazon Cognito, developers can add authentication and authorization features to their applications without the need to create, manage, and scale their own authentication infrastructure. Additionally, the service also offers features such as user data storage and data synchronization between devices.</p><p>Amazon Cognito can be used in a variety of use cases, including:</p><p><ul><li>User authentication: the service allows users to log in to applications using a variety of identity providers, including social networks such as Facebook, Google, Twitter, and Amazon.</p><p></li><li>User registration: the service allows users to register for applications using a variety of identity providers and provide additional information such as email address and phone number.</li><li>User management: the service allows developers to manage users and their information, including passwords, profile information, and authentication data.</li><li>Data synchronization: the service allows applications to synchronize data between user devices and the cloud, including configuration information, preferences, and application data.</ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "RabbitMQ",
      "info": "",
      "release": "2023-04-18",
      "name": "RabbitMQ",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>RabbitMQ is an open-source message queuing software that provides an asynchronous messaging platform for applications. It enables reliable and scalable communication between different parts of the application, such as services and microservices.</p><p>RabbitMQ implements the Advanced Message Queuing Protocol (AMQP) message protocol and can be used with a variety of programming languages, including Java, Python, Ruby, .NET, Node.js, and many others. It uses a queue architecture to store messages in buffers until they can be processed.</p><p>RabbitMQ can be used in a variety of use cases, including:<ul><li>Application integration: RabbitMQ allows applications to communicate asynchronously, facilitating integration between different systems and applications.</li><li>Microservices: RabbitMQ is a popular tool for implementing the microservices architecture, where different parts of the application are separated into independent services that communicate through messages.</li><li>Scalability: RabbitMQ can be used to handle large volumes of messages in high-load applications, allowing the application to be horizontally scaled.</li><li>Fault tolerance: RabbitMQ offers fault tolerance features, such as the ability to store messages in temporary queues, allowing applications to recover from failures without losing messages.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Kafka",
      "info": "",
      "release": "2023-04-18",
      "name": "Kafka",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Apache Kafka is a distributed data streaming platform that enables the creation of scalable real-time processing systems. It is designed to handle large volumes of data and process them quickly and reliably.</p><p>Kafka is based on a publish-subscribe model, in which producers publish data to topics and consumers subscribe to these topics to receive the data. Kafka is highly scalable, allowing it to efficiently and distributedly handle large amounts of data.</p><p>Kafka can be used in a variety of use cases, including:<ul><li>Real-time data streaming: Kafka is used in many real-time data streaming systems to process data at high speed and perform real-time analytics.</li><li>Application integration: Kafka can be used to integrate different applications, allowing them to communicate efficiently and distributedly.</li><li>Data storage: Kafka can also be used as a distributed and scalable data storage system.</li><li>Event processing: Kafka is often used in event processing systems, such as real-time monitoring and alerting systems.</li><li>Big data: Kafka is used in many big data systems as part of the infrastructure for collecting, storing, and analyzing data on a large scale.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Prometeus",
      "info": "",
      "release": "2023-04-18",
      "name": "Prometeus",
      "ring": "assess",
      "quadrant": "platforms-and-aoe-services",
      "body": "<p>Prometheus is an open-source monitoring platform designed to collect, store, and query metrics from distributed systems. It was developed by the engineering team at SoundCloud and is now a project of the Cloud Native Computing Foundation (CNCF).</p><p>Prometheus uses a pull-based metric collection model, in which data collection agents (exporters) are deployed on each system or application to collect metrics and send them to the Prometheus server. Prometheus also provides a flexible and powerful query language to explore and visualize metric data.</p><p>Prometheus can be used in a variety of use cases, including:<ul><li>Infrastructure monitoring: Prometheus can be used to monitor computing systems, such as servers, networks, and storage devices, providing information on performance and availability.</li><li>Application monitoring: Prometheus can be used to monitor applications in real-time, collecting information on performance, behavior, and application integrity.</li><li>Microservices monitoring: Prometheus is widely used in microservices environments, where each service can be monitored separately and scaled independently.</li> <li>Container monitoring: Prometheus can be used to monitor container environments, such as Kubernetes and Docker Swarm, collecting container and cluster metrics.</li><li>Trend analysis: Prometheus can be used to track trends and patterns in metric data over time, allowing users to identify issues and take preventive measures.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Terraform",
      "info": "",
      "release": "2023-04-18",
      "name": "Terraform",
      "ring": "assess",
      "quadrant": "platforms-and-aoe-services",
      "body": "<p>Terraform is an open-source tool that allows for infrastructure automation as code. It provides a declarative language for describing and managing an application's cloud infrastructure, such as servers, networks, databases, and other cloud resources.</p><p>Terraform is used to efficiently and securely create, modify, and version infrastructures, using the same source control methodology used in software development. It is designed to work with popular cloud providers such as Amazon Web Services (AWS), Microsoft Azure, Google Cloud Platform (GCP), and others.</p><p>Terraform can be used in a variety of use cases, including:<ul><li>Infrastructure automation: Terraform allows for the creation, modification, and deletion of infrastructure resources as code, enabling the automation of repetitive tasks and maintaining a consistent infrastructure state.</li><li>Infrastructure provisioning: Terraform can be used to create and configure infrastructure resources such as servers, networks, databases, and others, making it easier to create and configure development and production environments.</li><li>Cloud orchestration: Terraform can be used to orchestrate resources across different cloud providers and automate cloud management tasks.</li><li>Infrastructure as code: Terraform enables development and operations teams to manage infrastructure as code, allowing infrastructure to be versioned, tested, and managed using the same software development practices.</li><li>Environment provisioning: Terraform can be used to provision development, testing, and production environments, ensuring that these environments are consistent and reproducible.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Kubernetes",
      "info": "",
      "release": "2023-04-18",
      "name": "Kubernetes",
      "ring": "assess",
      "quadrant": "platforms-and-aoe-services",
      "body": "<p>Kubernetes (also known as K8s) is an open-source platform for container orchestration. It was developed by Google and is now maintained by the Cloud Native Computing Foundation (CNCF).</p><p>Kubernetes allows development teams to deploy, manage, and scale containerized applications in an automated and scalable way. It provides an environment for managing, deploying, and scaling containerized applications on server clusters, regardless of the cloud provider or underlying hardware.</p><p>Kubernetes can be used in a variety of use cases, including:<ul><li>Application deployment: Kubernetes allows development teams to deploy applications in containerized form in an automated and scalable way, reducing deployment time and increasing application reliability.<li>Container management: Kubernetes manages containers and the resources required to run them, such as networks, storage, and computing resources.</li><li>Auto-scaling: Kubernetes provides auto-scaling resources to increase or decrease the number of application replicas based on demand, ensuring system resources are used efficiently and reducing costs.</li><li>Rolling updates and rollbacks: Kubernetes allows development teams to update applications in production with zero downtime, as well as allowing for update reversals in case of problems.</li><li>Multi-location deployment: Kubernetes allows applications to be deployed in multiple environments, including public, private, and hybrid clouds.Service management: Kubernetes automatically manages service discovery, load balancing, and traffic management for container-deployed applications.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Ansible",
      "info": "",
      "release": "2023-04-18",
      "name": "Ansible",
      "ring": "assess",
      "quadrant": "platforms-and-aoe-services",
      "body": "<p>Ansible is an open-source IT automation platform that provides tools to automate configuration, management, and software deployment tasks. It was developed by Red Hat and is now maintained by Ansible, Inc.</p><p>Ansible can be used to automate a wide range of IT management tasks, including:</p><ul><li>Server configuration: Ansible allows operations teams to configure servers in an automated way, ensuring that servers are set up correctly and in compliance with security and compliance policies.</li><li>Configuration management: Ansible can manage and maintain the configuration of systems and applications, including package installation, file and directory configuration, service configuration, and more.</li><li>Application deployment: Ansible can automate the deployment of applications in different environments, from development to production, reducing downtime and human errors.</li><li>Cloud management: Ansible can manage resources in public and private clouds, including Amazon Web Services (AWS), Microsoft Azure, Google Cloud Platform (GCP), and others.</li><li>Task orchestration: Ansible allows operations teams to orchestrate complex tasks in an automated way, such as security updates, backups, disaster recovery, and more.</li><li>Infrastructure provisioning: Ansible can automatically provision the infrastructure necessary to support applications, including servers, networks, storage, and other resources.</li><li>Network configuration management: Ansible can automate network configuration management, including router, switch, and firewall configuration.</li></ul><p>In summary, Ansible is a powerful platform that allows operations teams to automate repetitive tasks and reduce the time and effort required to manage IT infrastructure. It provides a simple, human-readable language to describe infrastructure, allowing operations teams to manage infrastructure as code.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "APP Center",
      "info": "",
      "release": "2023-04-18",
      "name": "APP Center",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>The App Center is a platform for mobile application integration and continuous delivery for iOS, Android, and other platforms. With it, it's possible to automate processes of compiling, testing, and distributing applications, integrate with third-party tools, and monitor application performance in real-time.</p><ul><li>Mobile app development for businesses</li><li>Creation of educational applications</li><li>Simplification of internal processes within an organization</li><li>Testing and distribution of mobile applications to the general public or to a specific audience</li><li>Integration with other development platforms and tools</li><li>Real-time monitoring of application data and performance.</li></ul>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Bitrise",
      "info": "",
      "release": "2023-04-18",
      "name": "Bitrise",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<div><p>Bitrise is a continuous integration and delivery (CI/CD) automation platform for mobile applications. It is designed to help developers create, test, and distribute mobile apps faster and more efficiently by automating processes such as app building, testing, analysis, and distribution.</p><p>Some possible applications of Bitrise include:</p><ul><li>Automating mobile app testing to ensure the quality of the final product</li><li>Integration with other services such as code repositories and data analysis platforms</li><li>Continuous distribution of apps to end users</li><li>Real-time monitoring of metrics and app performance for continuous improvements</li> <li>Creating customized workflows for different development projects and teams</li><li>Providing useful insights and analysis to enhance the mobile app development process.</li></ul></div>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Fastlane",
      "info": "",
      "release": "2023-04-18",
      "name": "Fastlane",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Fastlane is a continuous integration and continuous delivery (CI/CD) automation tool for mobile application development. It is designed to help developers build, test, and distribute mobile apps faster and more efficiently by automating processes such as building, testing, analyzing, and distributing apps.</p><p>Some possible Fastlane applications include:<ul><li>Automating repetitive and time-consuming tasks such as building and distributing applications</li><li>Deploy application updates quickly and easily</li><li>Execution of automated tests to ensure the quality of the final product</li><li>Integration with other services such as code repositories and data analysis platforms</li><li>Continuous distribution of applications to end users</li><li>Providing useful insights and analytics to enhance the mobile app development process</li><li>Creating custom workflows for different projects and development teams.</p></li></ul><p>In summary, Fastlane can help developers save time and effort in the mobile application development and distribution process, making it more efficient and reliable.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Nginx",
      "info": "",
      "release": "2023-04-18",
      "name": "Nginx",
      "ring": "assess",
      "quadrant": "platforms-and-aoe-services",
      "body": "<p>Nginx is a high-performance web server and open-source reverse proxy that can be used for a variety of purposes, including:<ul><li>Web server: Nginx is often used as a web server to host websites and web applications, due to its ability to handle high volume of traffic and its flexible security settings.</li><li>Reverse Proxy: Nginx is used as a reverse proxy to distribute incoming traffic between backend servers, improving the performance and availability of an application.</li><li>Load Balancer: Nginx can be used as a load balancer to distribute traffic across multiple backend servers, helping to improve an application's scalability and availability.</li><li>Cache server: Nginx can be configured as a cache server to store static content and reduce the loading time of web pages, improving the user experience.</li><li>Media server: Nginx is often used as a media server to deliver audio and video files due to its ability to handle large amounts of media traffic and its flexible security settings.</li><li>API Server: Nginx is often used as an API server for hosting RESTful APIs and other HTTP-based APIs due to its ability to handle high volumes of API traffic and its flexible security settings.</li></ul></p>In summary, Nginx is a highly flexible and scalable tool that can be used to improve the performance, scalability and availability of web applications, APIs and other internet services. It is widely used in a variety of production environments around the world."
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Firebase",
      "info": "",
      "release": "2023-04-18",
      "name": "Firebase",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Firebase is a mobile and web app development platform that offers a set of tools to help developers build, improve, and expand their apps.</p><p>Firebase was acquired by Google in 2014 and has since been widely used by developers across the world.</p><p>Firebase is a complete platform and includes several features, such as:<ul><li>Authentication: Firebase provides an easy and secure solution for authenticating users in mobile and web apps.</li><li>Cloud storage: Firebase enables cloud storage of files and app data, making it easy to scale and make data available.</li><li>Real-time database: Firebase offers a real-time database that allows developers to build applications with real-time collaboration features, such as live chat.</li><li>Application Hosting: Firebase allows developers to host their applications on a scalable and secure infrastructure in the cloud.</li><li>Messaging and Notifications: Firebase includes a messaging service that allows developers to send personalized messages to users of their apps.</li><li>Data analytics: Firebase provides data analytics tools to help developers understand how users are using their apps and improve their experience.</li><li>App testing and distribution: Firebase includes tools for testing and distributing apps on different platforms, including Android and iOS.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "One Signal",
      "info": "",
      "release": "2023-04-18",
      "name": "One Signal",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>OneSignal is a push notification management platform that allows app developers to send notifications to users across multiple devices and platforms including Android, iOS and web. The OneSignal platform offers advanced segmentation, personalization and analytics capabilities, making it easy and effective to send push notifications to users across the world.</p><p>Some of OneSignal's key features include:<ul><li>Targeting: OneSignal allows developers to target their users based on various information such as location, device, usage behavior and much more.</li><li>Personalization: OneSignal allows developers to customize their notifications to provide a more relevant and engaging experience for users.</li><li>A/B Testing: OneSignal includes A/B testing capabilities to help developers optimize their push notification campaigns.</li><li>Analytics: OneSignal provides in-depth analytics to help developers understand how users are interacting with their notifications and improve their effectiveness.</li><li>Integrations: OneSignal integrates with a variety of tools and platforms including Firebase, Amazon SNS and Twilio.</li></ul></p><p>OneSignal is a powerful platform for app developers who want to communicate with their users effectively and efficiently through push notifications. It is widely used around the world by developers of all sizes, from startups to large enterprises.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Github Copilot",
      "info": "",
      "release": "2023-04-18",
      "name": "Github Copilot",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>GitHub Copilot is an artificial intelligence (AI)-based programming tool developed by OpenAI in partnership with GitHub. It uses machine learning to generate code suggestions based on context and user input, making programming faster and easier.</p><p>Some possible applications of GitHub Copilot include:<ul><li>Code completion and provide autocomplete suggestions</li><li>Generate code for functions and methods based on context and user input</li><li>Propose solutions to common programming problems</li><li>Help identify and correct syntax errors</li><li>Accelerate the software development process by reducing the time spent writing and debugging code.</li></ul></p><p>GitHub Copilot can be used by developers of all skill levels, from beginners to seasoned pros, to speed up code creation and help solve programming problems.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Chat GPT",
      "info": "",
      "release": "2023-04-18",
      "name": "Chat GPT",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>GPT (Generative Pre-trained Transformer) is a class of natural language models based on artificial intelligence (AI) developed by OpenAI. They are trained on large amounts of natural language data to generate coherent and relevant text in response to a given text input.</p><p>>Some possible applications of GPT in the software development process include:<ul><li>Automatic generation of technical documentation: GPT can be used to generate technical documentation for software projects based on input descriptions. This can save time and effort for developers and other team members who need to create and maintain documentation.</li><li>Text analytics and sentiment detection: GPT can be used to analyze comments, reviews, and other forms of feedback to gain insights into the user experience. This can help the development team better understand what users are looking for and identify areas where the software can be improved.</li><li>Code generation: In some cases, GPT can be used to automatically generate code based on a text entry that describes a specific task or function. While this is still in the early stages of development, it is a growing area of research.</li><li>Chatbot Support: GPT can be used to build customer support chatbots that can answer common user questions and provide solutions to technical issues. This can help reduce the support team's workload and improve the user experience.</li><li>GPT Chat can be used to help solve those annoying problems that often stop us for a while at work, and with its help we can solve them more quickly.</li></ul></p><p>>Overall, GPT has the potential to be a powerful tool in the software development process, helping to automate tasks, improve communication, and provide valuable insights into the user experience.</p><p>>It was even used to generate this description above, as well as all the other tools, saving incredible time.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Playwright",
      "info": "",
      "release": "2023-04-18",
      "name": "Playwright",
      "ring": "assess",
      "quadrant": "languages-and-frameworks",
      "body": "<p>Playwright is a test automation library for web browsers developed by Microsoft. It allows developers to write automated end-to-end tests for web applications running in different browsers including Chrome, Firefox, Safari, Edge and others.</p><p>Playwright provides an easy to use and intuitive API that allows you to control and automate the browser's interaction with the webpage. This includes clicking buttons, filling out forms, navigating between pages, capturing screenshots, and much more. In addition, Playwright allows you to simulate mobile devices, emulate network conditions such as latency and speed, and manipulate cookies and other local storage information.</p><p>Playwright can be used for different purposes, including:<ul><li>Integration Testing: Allows developers to verify that different parts of the application work correctly together.</li><li>Acceptance Testing: Allows developers to verify that the application works correctly from an end-user point of view.</li><li>Regression Testing: Allows developers to verify whether changes made to the application affect expected behavior.</li><li>Task Automation: Allows developers to automate repetitive tasks such as filling out forms, downloading files, generating reports, and more.</li></ul></p><p>Playwright is a powerful and flexible tool for web application test automation, allowing developers to write robust and reliable tests that can run on different browsers and platforms.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Cypress",
      "info": "",
      "release": "2023-04-18",
      "name": "Cypress",
      "ring": "assess",
      "quadrant": "languages-and-frameworks",
      "body": "<p>Cypress is a front-end test automation framework for web applications. It was created to help developers write tests faster and easier, with a simple and intuitive API.</p><p>Cypress is used to test web apps on different browsers including Chrome, Firefox, Safari and Edge. It allows developers to write automated end-to-end tests that simulate user actions such as clicking buttons, filling out forms, navigating between pages, and much more. Cypress also offers advanced features such as video capture, screen capture and detailed reporting.</p><p>Some of the main features of Cypress include:<ul><li>Fast and Reliable Tests: Cypress runs the tests within the browser itself, which provides fast and reliable test execution.</li><li>Easy Debugging: Cypress offers built-in debugging capabilities that allow developers to quickly identify issues and easily debug tests.</li><li>Comprehensive documentation: Cypress has detailed documentation including examples and tutorials to help developers write effective tests.</li><li>Integration with other tools: Cypress can be integrated with other testing tools like Mocha and Chai, as well as continuous integration automation tools like Jenkins and Travis CI.</li></ul></p><p>Cypress can be used for different purposes including:<ul><li>Integration Testing: Allows developers to verify that different parts of the application work correctly together.</li><li>Acceptance Testing: Allows developers to verify that the application works correctly from an end-user point of view.</li><li>Regression Testing: Allows developers to verify whether changes made to the application affect expected behavior.</li><li>Task Automation: Allows developers to automate repetitive tasks such as filling out forms, downloading files, generating reports, and more.</li></ul></p><p>Cypress is a powerful and easy-to-use web application test automation tool, allowing developers to write fast, reliable and effective tests to ensure the quality of their applications.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Postman",
      "info": "",
      "release": "2023-04-18",
      "name": "Postman",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Postman is a collaboration platform for API developers. It lets you easily test, document, and share APIs. With its user-friendly interface and advanced features, Postman makes the API development process more efficient and effective.</p><p>Some of the possible uses for Postman are:<ul><li>Testing APIs: Postman lets you send HTTP requests and view responses, helping you test and validate APIs.</li><li>Document APIs: With Postman's documentation feature, developers can create complete, easy-to-understand documentation for their APIs.</li><li>Automate API Tests: Postman can be used to create and run automated API tests, saving time and ensuring test consistency.</li><li>Team Collaboration: Postman allows development teams to work together on API projects, sharing information and collaborating in real time.</li><li>Integration with other tools: Postman can be integrated with other development tools such as GitHub and Jira to ease developers' workflow.</li></ul></p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Jmeter",
      "info": "",
      "release": "2023-04-18",
      "name": "Jmeter",
      "ring": "assess",
      "quadrant": "tools",
      "body": "<p>Apache JMeter is an open source and open source load testing tool developed by the Apache Software Foundation. It is used to test the loadability, performance and stability of web applications, databases and network services.</p><p>JMeter is used to simulate the load on a web application by generating HTTP requests simulating the behavior of a large number of users accessing the system simultaneously. It can also be used to generate a load on a network service or database.</p><p>Some of the key features of JMeter include:<ul><li>Creating Test Scripts: JMeter lets you create test scripts to simulate different web application usage scenarios.</li><li>Configuration of test scenarios: JMeter allows you to configure different test scenarios, such as the number of simulated users, the test time and the type of HTTP requests to be generated.</li><li>Performance Monitoring: JMeter provides performance monitoring capabilities to measure response time and other web application performance metrics.</li><li>Reporting: JMeter allows you to generate detailed reports on the performance of your web application during testing.</li></ul></p><p>JMeter can be used for different purposes including:<ul><li>Load Testing: Allows you to test the system's ability to handle a large number of users simultaneously.</li><li>Performance Test: Allows you to test system performance under different load conditions.</li><li>Stress Test: Lets you test the system's ability to handle unexpected spikes in traffic or requests.</li><li>Performance Monitoring: Allows you to monitor system performance in real time and identify bottlenecks or performance issues.</li></ul></p><p>JMeter is a powerful and flexible tool for load and performance testing of web applications, allowing developers and testers to identify performance issues before putting an application into production.</p>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Architecture Drawing",
      "info": "",
      "release": "2023-04-18",
      "name": "Architecture Drawing",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/architecture-drawing' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Automated Test",
      "info": "",
      "release": "2023-04-18",
      "name": "Automated Test",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/automated-test' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "CI-CD",
      "info": "",
      "release": "2023-04-18",
      "name": "CI CD",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/ci-cd' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Code Review",
      "info": "",
      "release": "2023-04-18",
      "name": "Code Review",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/code-review' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Code Style",
      "info": "",
      "release": "2023-04-18",
      "name": "Code Style",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/code-style' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Observability",
      "info": "",
      "release": "2023-04-18",
      "name": "Observability",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/observability' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "SOLID",
      "info": "",
      "release": "2023-04-18",
      "name": "SOLID",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/SOLID' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Technical Agreements",
      "info": "",
      "release": "2023-04-18",
      "name": "Technical Agreements",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/technical-agreements' target='_blank'>Link</a>"
    },
    {
      "flag": "new",
      "featured": true,
      "revisions": [],
      "title": "Versioning Strategy",
      "info": "",
      "release": "2023-04-18",
      "name": "Versioning Strategy",
      "ring": "adopt",
      "quadrant": "methods-and-patterns",
      "body": "<p>This concept was explained in depth in our engineering guide, check this link: <p><a href='https://engineerguide.db1.com.br/docs/best-practices/versioning-strategy' target='_blank'>Link</a>"
    }
  ],
  "releases": ["2023-01-11"]
}
