{
  "translation": {
    "radarName": "Radar Tecnológico",
    "versionLabel": "Versión",
    "buttonChangeLanguage": "Cambiar idioma",
    "revisionsText": "Revisiones:",
    "navbar": {
      "help": "¿Cómo usar Radar Tecnológico?",
      "overview": "Panorama de las tecnologías",
      "search": "Busque en",
      "searchPlaceholder": "¿Qué busca?"
    },
    "footerFootnote": "El DB1 Group está formado por empresas de tecnología, con tres operaciones en Brasil, una en Argentina y otra en Estados Unidos. Tiene 20 años de experiencia en el mercado de tecnología, ofreciendo SaaS y servicios de desarrollo de software para otras empresas. Siempre ofreciendo productos y servicios premium y de alta calidad, las empresas del grupo son líderes en el mercado. Los negocios del Grupo DB1 son: ANYMARKET, Consignet, DB1 Global Software, Koncili, Eive, Predize y el robot Tinbot. DB1 Global Software ha sido la primera empresa del grupo DB1 y actualmente representa el 50% del negocio del grupo y da servicio a empresas de todo el continente americano. Traducción realizada con la versión gratuita del traductor www.DeepL.com/Translator",
    "legalInformationLabel": "Creado con el radar AOE",
    "socialLinksLabel": "Síguenos:",
    "pageIndex": {
      "publishedLabel": "Visión general del cuadrante"
    },
    "pageItem": {
      "quadrantOverview": "Visión general del cuadrante"
    },
    "zoom-in": "Ampliar",
    "quadrant": "cuadrante",
    "quadrants": {
      "languages-and-frameworks": "Lenguajes y marcos",
      "methods-and-patterns": "Métodos y modelos",
      "platforms-and-aoe-services": "Plataformas y operaciones",
      "tools": "Herramientas"
    },
    "pageOverview": {
      "title": "Panorama de las tecnologías"
    },
    "rings": {
      "all": "todos",
      "adopt": "adopte",
      "trial": "ensayo",
      "assess": "evalúe",
      "hold": "mantener"
    },
    "pageHelp": {
      "headlinePrefix": "Cómo utilizar el",
      "paragraphs": [
        {
          "headline": "Introducción",
          "values": [
            "La tecnología avanza deprisa y continuamente aparecen nuevas tecnologías e innovaciones.",
            "Para una empresa de desarrollo y tecnología como DB1 es esencial mejorar constantemente y mantenerse al día de las últimas innovaciones útiles. Es importante buscar abiertamente innovaciones y nuevas tecnologías y cuestionar de vez en cuando las tecnologías y los métodos establecidos.",
            "Pero también es importante elegir sabiamente qué tecnologías utilizar en nuestro trabajo diario y en los distintos proyectos que llevamos a cabo. Como todos sabemos: No hay una bala de plata."
          ]
        },
        {
          "headline": "¿Qué es el radar tecnológico DB1?",
          "values": [
            "El Radar Tecnológico es una panorámica de las distintas tecnologías -desde lenguajes, frameworks, herramientas y patrones hasta plataformas- que consideramos 'nuevas o mencionables'. Por lo tanto, el radar no ofrece una visión general de todas las tecnologías establecidas, sino que se centra en los elementos que han ganado importancia o han cambiado recientemente."
          ]
        },
        {
          "headline": "Cómo se crea",
          "values": [
            "Los puntos del radar tecnológico son planteados por los distintos equipos y, por tanto, muchos de ellos están relacionados con el trabajo y los retos a los que se enfrentan los equipos en los distintos proyectos. De hecho, no incluimos nada en el radar que no hayamos probado nosotros mismos al menos una vez.",
            "Ha habido muchos y valiosos debates en distintos grupos de expertos sobre la clasificación y los detalles de cada una de las tecnologías e innovaciones. Y el resultado de todo ello puede encontrarse en el último radar tecnológico."
          ]
        },
        {
          "headline": "Cómo debe utilizarse",
          "values": [
            "El radar actúa como una visión general de las tecnologías que creemos que todos los miembros de los equipos deberían conocer en la actualidad.",
            "Su objetivo es servir de guía e inspiración para el trabajo diario en los equipos. Su propósito es también proporcionar información útil y una perspectiva a vista de pájaro, de modo que las decisiones puedan tomarse con una comprensión mucho más profunda del asunto. El resultado son decisiones más informadas y mejor alineadas.",
            "También esperamos que los desarrolladores ajenos a DB1 encuentren inspiradora la información de nuestro resumen tecnológico.",
            "Agrupamos o clasificamos los artículos en 4 cuadrantes - (a veces, cuando no está 100% claro a qué cuadrante pertenece un artículo, elegimos el que mejor encaja)."
          ]
        }
      ],
      "quadrants": [
        {
          "description": "Aquí hemos colocado lenguajes de desarrollo, marcos de desarrollo, que son útiles para implementar software personalizado de todo tipo.",
          "name": "Lenguajes y marcos"
        },
        {
          "description": "Aquí presentamos diferentes herramientas de software, desde pequeños ayudantes hasta grandes proyectos de software.",
          "name": "Herramientas"
        },
        {
          "description": "Los patrones son muy importantes, y muchos de ellos son válidos durante mucho tiempo (en comparación con algunas herramientas o frameworks). Así pues, esta es la categoría en la que ponemos información sobre métodos y patrones relativos al desarrollo, x continuo, pruebas, organización, arquitectura, etc.",
          "name": "Métodos y modelos"
        },
        {
          "description": "(incluidos los servicios internos de DB1): Aquí incluimos plataformas y servicios de infraestructura. También utilizamos esta categoría para comunicar noticias sobre los servicios de DB1 que queremos que todos los equipos de DB1 conozcan.",
          "name": "Plataformas y operaciones"
        }
      ],
      "quadrantsPreDescription": "Los cuadrantes son:",
      "rings": [
        {
          "description": "Podemos recomendar claramente esta tecnología. La hemos utilizado durante mucho tiempo en muchos equipos y ha demostrado ser estable y útil.",
          "name": "Adopte"
        },
        {
          "description": "Lo hemos utilizado con éxito y recomendamos echar un vistazo más de cerca a la tecnología de este anillo. El objetivo de los artículos aquí es mirarlos más de cerca, con el objetivo de llevarlos al nivel de adopción.",
          "name": "Ensayo"
        },
        {
          "description": "Lo hemos probado y nos parece prometedor. Le recomendamos que eche un vistazo a estos artículos cuando se enfrente a una necesidad específica de la tecnología en su proyecto.",
          "name": "Evalúe"
        },
        {
          "description": "Esta categoría es un poco especial. A diferencia de las demás, recomendamos dejar de hacer o usar algo. Eso no significa que sean malas y a menudo puede estar bien utilizarlas en proyectos existentes. Pero movemos las cosas aquí si creemos que no deberíamos seguir haciéndolas, porque ahora vemos mejores opciones o alternativas.",
          "name": "Mantener"
        }
      ],
      "ringsPreDescription": "Cada uno de los artículos se clasifica en uno de estos anillos:",
      "sourcecodeLink": {
        "description": "Las contribuciones y el código fuente de Radar Técnico están en github:",
        "href": "https://github.com/AOEpeople/aoe_technology_radar",
        "name": "AOE Radar Técnico en Github"
      }
    },
    "legend": {
      "new": "Nueva en esta versión",
      "recently": "Cambiado recientemente",
      "unchanged": "Sin alterar"
    },
    "flags": {
      "new": "Nuevo"
    }
  }
}