{
  "translation": {
    "radarName": "Radar Tecnológico",
    "versionLabel": "Versão",
    "revisionsText": "Revisões:",
    "buttonChangeLanguage": "Alterar idioma",
    "navbar": {
      "help": "Como usar o Radar Tecnológico?",
      "overview": "Visão geral das tecnologias",
      "search": "Buscar",
      "searchPlaceholder": "O que você está procurando?"
    },
    "footerFootnote": "DB1 Group é formada por empresas de tecnologia, com três operações no Brasil, uma na Argentina e uma nos Estados Unidos. Possui 20 anos de experiência no mercado de tecnologia, oferecendo SaaS e serviços de desenvolvimento de software para outras empresas. Oferecendo sempre produtos e serviços premium e de alta qualidade, as empresas do grupo são líderes de mercado. Os negócios do DB1 Group são: ANYMARKET, Consignet, DB1 Global Software, Koncili, Eive, Predize e o robô Tinbot. A DB1 Global Software foi a primeira empresa do grupo DB1 e atualmente representa 50% dos negócios do grupo e atende empresas em todas as Américas.",
    "legalInformationLabel": "Criado usando o Radar AOE",
    "socialLinksLabel": "Siga-nos:",
    "pageIndex": {
      "publishedLabel": "Visão geral do quadrante"
    },
    "pageItem": {
      "quadrantOverview": "Visão geral do quadrante"
    },
    "zoom-in": "Ampliar",
    "quadrant": "quadrante",
    "quadrants": {
      "languages-and-frameworks": "Idiomas e estruturas",
      "methods-and-patterns": "Métodos e padrões",
      "platforms-and-aoe-services": "Plataformas e operações",
      "tools": "Ferramentas"
    },
    "pageOverview": {
      "title": "Visão geral das tecnologias"
    },
    "rings": {
      "all": "todos",
      "adopt": "adotar",
      "trial": "teste",
      "assess": "avaliar",
      "hold": "manter"
    },
    "pageHelp": {
      "headlinePrefix": "Como usar o",
      "paragraphs": [
        {
          "headline": "Introdução",
          "values": [
            "A tecnologia está se movendo rapidamente e novas tecnologias e inovações surgem continuamente.",
            "É essencial para uma empresa de desenvolvimento e tecnologia como a DB1 melhorar constantemente e acompanhar as últimas inovações úteis. É importante procurar abertamente por inovações e novas tecnologias e questionar as tecnologias e os métodos estabelecidos de vez em quando.",
            "Mas também é importante escolher sabiamente quais tecnologias usar em nosso trabalho diário e nos diferentes projetos que estamos realizando. Como todos nós sabemos: Não existe bala de prata."
          ]
        },
        {
          "headline": "O que é o Radar Tecnológico DB1?",
          "values": [
            "O Radar Tecnológico é uma visão geral de diferentes tecnologias - de linguagens, estruturas, ferramentas e padrões a plataformas - que consideramos 'novas ou mencionáveis'. Portanto, o radar não oferece uma visão geral de todas as tecnologias estabelecidas, mas se concentra em itens que ganharam importância ou mudaram recentemente."
          ]
        },
        {
          "headline": "Como ele é criado",
          "values": [
            "Os itens do Radar Tecnológico são levantados pelas diferentes equipes e, portanto, muitos deles estão relacionados ao trabalho e aos desafios que as equipes enfrentam nos diferentes projetos. Na verdade, não incluímos nada no radar que já não tenhamos experimentado pelo menos uma vez.",
            "Houve muitas discussões valiosas em diferentes grupos de especialistas sobre a classificação e os detalhes de cada uma das tecnologias e inovações. E o resultado de tudo isso pode ser encontrado no radar de tecnologia mais recente."
          ]
        },
        {
          "headline": "Como deve ser usado",
          "values": [
            "O radar funciona como uma visão geral das tecnologias que, em nossa opinião, todos os membros das equipes deveriam conhecer.",
            "Seu objetivo é servir de guia e inspiração para o trabalho diário das equipes. Seu objetivo também é fornecer informações úteis e uma perspectiva panorâmica, de modo que as decisões possam ser tomadas com uma compreensão muito mais profunda do assunto. Isso resulta em decisões mais bem informadas e mais bem alinhadas.",
            "Também esperamos que os desenvolvedores de fora da DB1 considerem as informações em nossa visão geral da tecnologia inspiradoras.",
            "Agrupamos ou categorizamos os itens em 4 quadrantes - (às vezes, quando não está 100% claro onde um item pertence, escolhemos o mais adequado)."
          ]
        }
      ],
      "quadrants": [
        {
          "description": "Aqui colocamos linguagens de desenvolvimento e estruturas de desenvolvimento que são úteis para a implementação de software personalizado de todos os tipos.",
          "name": "Idiomas e estruturas"
        },
        {
          "description": "Aqui colocamos diferentes ferramentas de software, desde pequenos ajudantes até projetos de software maiores",
          "name": "Ferramentas"
        },
        {
          "description": "Os padrões são muito importantes, e muitos deles são válidos por muito tempo (em comparação com algumas ferramentas ou estruturas). Portanto, esta é a categoria em que colocamos informações sobre métodos e padrões relacionados a desenvolvimento, x contínuo, testes, organização, arquitetura etc.",
          "name": "Métodos e padrões"
        },
        {
          "description": "(incluindo os serviços internos do DB1): Aqui incluímos plataformas e serviços de infraestrutura. Também usamos essa categoria para comunicar notícias sobre os serviços da DB1 que queremos que todas as equipes da DB1 conheçam.",
          "name": "Plataformas e operações"
        }
      ],
      "quadrantsPreDescription": "Os quadrantes são:",
      "rings": [
        {
          "description": "Podemos recomendar claramente essa tecnologia. Nós a usamos por um longo período de tempo em muitas equipes e ela provou ser estável e útil.",
          "name": "Adotar"
        },
        {
          "description": "Nós o utilizamos com sucesso e recomendamos que você dê uma olhada mais de perto na tecnologia desse anel. A meta dos itens aqui é examiná-los mais de perto, com o objetivo de levá-los ao nível de adoção.",
          "name": "Julgamento"
        },
        {
          "description": "Nós os experimentamos e os consideramos promissores. Recomendamos que dê uma olhada nesses itens quando se deparar com uma necessidade específica da tecnologia em seu projeto.",
          "name": "Avaliar"
        },
        {
          "description": "Esta categoria é um pouco especial. Ao contrário das outras, recomendamos que você pare de fazer ou usar algo. Isso não significa que eles sejam ruins e, muitas vezes, pode ser bom usá-los em projetos existentes. Mas movemos as coisas para cá se acharmos que não devemos mais fazê-las, porque vemos opções ou alternativas melhores agora.",
          "name": "Manter"
        }
      ],
      "ringsPreDescription": "Cada um dos itens é classificado em um desses anéis:",
      "sourcecodeLink": {
        "description": "As contribuições e o código-fonte do Radar Técnico estão no github:",
        "href": "https://github.com/AOEpeople/aoe_technology_radar",
        "name": "Radar Técnico da AOE no Github"
      }
    },
    "legend": {
      "new": "Novidade nesta versão",
      "recently": "Recentemente alterado",
      "unchanged": "Inalterada"
    },
    "flags": {
      "new": "Novo"
    }
  }
}